https://stackoverflow.com/a/59429952/4527289

In [ ]:
!gdown --id 1BSHIKQ7rFw5BpTq5nw1UZfjPK_7Mpnbi
!mv _sqlite3.cpython-37m-x86_64-linux-gnu.so /usr/lib/python3.7/lib-dynload/
import os
os.kill(os.getpid(), 9)

'gdown' is not recognized as an internal or external command,
operable program or batch file.

In [1]:
import pandas as pd
import numpy as np

In [2]:
import sqlite3

In [3]:
sqlite3.sqlite_version

'3.33.0'

In [4]:
con = sqlite3.connect('db')

https://drive.google.com/file/d/1Gj0qVU0Acv-HqRjTIEwvkO4TqJYijehR/view?usp=sharing

In [5]:
!gdown --id 1Gj0qVU0Acv-HqRjTIEwvkO4TqJYijehR

'gdown' is not recognized as an internal or external command,
operable program or batch file.

In [7]:
df = pd.read_csv(r'C:\Users\User\Desktop\j\SQL-G\german_credit_augmented.csv')

In [8]:
df.head()

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,NaN,NaN,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,52,male,2,own,quite rich,NaN,936,9,education,0,2008-04-27 08:23:07,200
3,35,female,3,own,little,NaN,1393,11,car,0,2007-05-06 10:58:22,45
4,28,male,2,own,little,NaN,776,12,radio/TV,0,2007-07-21 13:22:14,358

In [9]:
df['contract_dt'] = pd.to_datetime(df['contract_dt'],format='%Y-%m-%d %H:%M:%S')

In [10]:
df.dtypes

age                          int64
sex                         object
job                          int64
housing                     object
saving_accounts             object
checking_account            object
credit_amount                int64
duration                     int64
purpose                     object
default                      int64
contract_dt         datetime64[ns]
client_id                    int64
dtype: object

In [11]:
df.to_sql('german_credit',con,index=False,if_exists='replace')

1000

In [12]:
df.shape

(1000, 12)

In [13]:
def select(sql):
  return pd.read_sql(sql,con)

In [14]:
sql = '''select t.* from german_credit t limit 5'''

In [15]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,None,None,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,52,male,2,own,quite rich,None,936,9,education,0,2008-04-27 08:23:07,200
3,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
4,28,male,2,own,little,None,776,12,radio/TV,0,2007-07-21 13:22:14,358